---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures
source: html/708a70b0-aec1-52ff-47c4-4d6ffce09e24.htm
---
# BuiltInFailures.ColorFillFailures Properties

A Color Fill Legend can only be placed in a Floor Plan View or a Section View.